belan581/smart_sensors_workshop/firmware/sdkconfig.defaults
# sdkconfig.defaults — Configuración base para el taller
# ESP-IDF aplica estos valores si no existen en sdkconfig

# ─── Target ────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32s3"

# ─── WiFi ──────────────────────────────────────────────────────
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=n

# ─── BLE Provisioning ──────────────────────────────────────────
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

# ─── mDNS ──────────────────────────────────────────────────────
CONFIG_MDNS_MAX_SERVICES=5

# ─── MQTT ──────────────────────────────────────────────────────
CONFIG_MQTT_PROTOCOL_311=y
CONFIG_MQTT_TRANSPORT_TCP=y

# ─── HTTP Server ───────────────────────────────────────────────
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_HTTPD_MAX_RESP_HEADERS=8

# ─── FreeRTOS ──────────────────────────────────────────────────
# Stack más grande para tareas con JSON (cJSON usa bastante stack)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# ─── Logging ───────────────────────────────────────────────────
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# ─── Partition table ───────────────────────────────────────────
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ─── Flash size ────────────────────────────────────────────────
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# ─── cJSON ─────────────────────────────────────────────────────
# Incluido en ESP-IDF, no requiere componente externo
CONFIG_CJSON_OVERRIDE_BUILD_TARGET=n
